Процедура ЗаполнитьТабличнуюЧастьТоварыОтрицательнымиОстатками() Экспорт //Болтрушко 20.08.2025
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыОрганизацийОстатки.КоличествоОстаток КАК Количество,
		|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика.СИ_ЦенаУчетная КАК Цена,
		|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика.СИ_ЦенаУчетная * ТоварыОрганизацийОстатки.КоличествоОстаток КАК Сумма,
		|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.СкладскаяТерритория КАК Склад
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций.Остатки(&Период, ) КАК ТоварыОрганизацийОстатки
		|ГДЕ
		|	ТоварыОрганизацийОстатки.КоличествоОстаток < 0
		|	И ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.СкладскаяТерритория = &Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.СкладскаяТерритория,
		|	ТоварыОрганизацийОстатки.КоличествоОстаток,
		|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика,
		|	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика.СИ_ЦенаУчетная";
	
	Запрос.УстановитьПараметр("Период", КонецДня(Дата));
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.СкладскаяТерритория = &Склад", "");
	Иначе
		Запрос.УстановитьПараметр("Склад", Склад);	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда	
		Товары.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры
