//12311 TEST
&НаСервере
Процедура ЗаполнитьОтрицательныеОстаткиНаСервере()Экспорт 
	//ТЕСТ 123
	ВремОбъект = РеквизитФормыВЗначение("Объект");

	ВремОбъект.Товары.Очистить();
	ВремОбъект.ЗаполнитьТабличнуюЧастьТоварыОтрицательнымиОстатками();

	ЗначениеВРеквизитФормы(ВремОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;
    
 	ЗаполнитьОтрицательныеОстаткиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтрицательныеОстатки(Команда)

	Если Объект.Товары.Количество() > 0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), НСтр("ru = 'Табличная часть будет очищена и заполнена всеми товарами,которые имеют отрицательные остатки. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;

	ЗаполнитьОтрицательныеОстаткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьОприходованиеНаСервере()
	
	Склад = Неопределено;
	ДокументОбъектПрочееОприходование = Неопределено;
	
	Для Каждого Строка из Объект.Товары Цикл
		Если Строка.Склад <> Склад Тогда
			
			Если ДокументОбъектПрочееОприходование <> Неопределено Тогда
				ДокументОбъектПрочееОприходование.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
			Склад = Строка.Склад; 
			ДокументОбъектПрочееОприходование = Документы.ОприходованиеИзлишковТоваров.СоздатьДокумент();
			ДокументОбъектПрочееОприходование.Организация = Справочники.Организации.ПолучитьОрганизациюПоУмолчанию();
			ДокументОбъектПрочееОприходование.Ответственный = Пользователи.ТекущийПользователь();
			ДокументОбъектПрочееОприходование.СИ_Статус = Перечисления.СИ_СтатусыПересортицыТоваров.Согласовано;
			ДокументОбъектПрочееОприходование.Склад = Склад;
			ДокументОбъектПрочееОприходование.Валюта = Справочники.Валюты.НайтиПоКоду("933");
			ДокументОбъектПрочееОприходование.Дата = КонецДня(Объект.Дата);
			
			НоваяСтрока = ДокументОбъектПрочееОприходование.Товары.Добавить();
			ЗаполнитьСтроку(НоваяСтрока, Строка);
		Иначе
			НоваяСтрока = ДокументОбъектПрочееОприходование.Товары.Добавить();
			ЗаполнитьСтроку(НоваяСтрока, Строка);
		КонецЕсли;		 
	КонецЦикла;
	
	ДокументОбъектПрочееОприходование.Записать(РежимЗаписиДокумента.Проведение);
		
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОприходование(Команда)
	СформироватьОприходованиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтроку(НоваяСтрока, Строка)
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	НоваяСтрока.Количество = Строка.Количество*(-1);
	НоваяСтрока.Сумма = Строка.Сумма*(-1);                                                                  
КонецПроцедуры;
